files/input/WebServices/getTransactionFrame.xml

<?xml version="1.0" encoding="UTF-8"?>
<!-- US#5678 : To get the Transaction information based on Transaction ID  -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header>
		<bm:userInfo xmlns:bm="urn:soap.bigmachines.com">
			<bm:sessionId>SESSION_ID</bm:sessionId>
		</bm:userInfo>
		<bm:category xmlns:bm="urn:soap.bigmachines.com">Commerce</bm:category>
		<bm:xsdInfo xmlns:bm="urn:soap.bigmachines.com">
			<bm:schemaLocation>https://SITE_NAME.bigmachines.com/bmfsweb/SITE_NAME/schema/v1_0/commerce/PROCESS_VAR_NAME.xsd</bm:schemaLocation>
		</bm:xsdInfo>
	</soapenv:Header>
	<soapenv:Body>
		<bm:getTransaction xmlns:bm="urn:soap.bigmachines.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
			<bm:transaction>
				<bm:id>TRANSACTION_ID</bm:id>
				<bm:return_specific_attributes>
					<bm:documents>
						<bm:document>
							<bm:var_name>transaction</bm:var_name>
							<bm:attributes>
								<bm:attribute>_document_number</bm:attribute>
							</bm:attributes>
						</bm:document>
						<bm:document>
							<bm:var_name>transactionLine</bm:var_name>
							<bm:attributes>
								<bm:attribute>_document_number</bm:attribute>
								<bm:attribute>_sequence_number</bm:attribute>
							</bm:attributes>
						</bm:document>
					</bm:documents>
				</bm:return_specific_attributes>
			</bm:transaction>
		</bm:getTransaction>
	</soapenv:Body>
</soapenv:Envelope>